This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None".
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId NoBarSizeWarning { get; }
  Visual Basic
Public Shared ReadOnly Property NoBarSizeWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoBarSizeWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace